In [177]:
import pandas as pd

* pd.series
* pd.Dataframe if I created using list I can declare any column name during df declaration
* pd.concat only accept series in list and not dataframe

* index and column in Datframe
* set_index to set index no
* dataframe.rename to rename rows and columns
* dataframe.column to rename columns must redeclare all
* dataframe.index to rename rows must redeclare all
* dataframe.value gives all value
* dataframe.row to rename rows must redeclare all
* Dataframe.T will teanspose

In [159]:
i = [1,2,3,4,5,6,7,8,9]

df = pd.DataFrame(i)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [160]:
j = pd.Series([1,2,3,4,5],name='X')
k = pd.Series(['a','b','g','h','t'],name='Z')

df = pd.DataFrame([j,k])
df1 = pd.concat([j,k],axis=1)

print(df)
print('=================')
print(df1)

   0  1  2  3  4
X  1  2  3  4  5
Z  a  b  g  h  t
=================
   X  Z
0  1  a
1  2  b
2  3  g
3  4  h
4  5  t

In [161]:
j = pd.Series([1,2,3,4,5])
k = pd.Series(['a','b','g','h','t'])

df = pd.DataFrame([j,k])
df1 = pd.concat([j,k],axis=1)

print(df)
print('=================')
print(df1)

   0  1  2  3  4
0  1  2  3  4  5
1  a  b  g  h  t
=================
   0  1
0  1  a
1  2  b
2  3  g
3  4  h
4  5  t

In [162]:
j = {'name' : 'Umair', "course": ['GenAI','Metaverse','Web3'], 'salary' : [50000,20000,90000]}

df1 = pd.DataFrame(j)

df1

    name     course  salary
0  Umair      GenAI   50000
1  Umair  Metaverse   20000
2  Umair       Web3   90000

In [163]:
s1 = [1,2,3,4,5]
s2 = [1,2,3,4,5]
s3 = [1,2,3,4,5]

series = {'s01':s1, 's2':s2, 's3':s3 }

df = pd.Series(series,name='a')

df1 = pd.DataFrame(series)

# df2 = pd.concat([df],axis=0)
df2 = pd.concat([df],axis=1)

print(df)
print('=================')
print(df1)
print('=================')
print(df2)

s01    [1, 2, 3, 4, 5]
s2     [1, 2, 3, 4, 5]
s3     [1, 2, 3, 4, 5]
Name: a, dtype: object
=================
   s01  s2  s3
0    1   1   1
1    2   2   2
2    3   3   3
3    4   4   4
4    5   5   5
=================
                   a
s01  [1, 2, 3, 4, 5]
s2   [1, 2, 3, 4, 5]
s3   [1, 2, 3, 4, 5]

In [164]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([1,2,3,4,5])
s3 = pd.Series([1,2,3,4,5])

df1 = pd.DataFrame([s1,s2,s3])

df2 = pd.concat([s1,s2,s3],axis=1)

print('=================')
print(df1)
print('=================')
print(df2)

=================
   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5
=================
   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5

In [165]:
s1 = [1,2,3,4,5]
s2 = [1,2,3,4,5]
s3 = [1,2,3,4,5]

df2 = pd.DataFrame([s1,s2,s3])
# df2 = pd.DataFrame([s1,s2,s3]).T # it will transpose change row with column

df2

   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [166]:
df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Age': [23, 25]
})

df_indexed = df.set_index('Name')
print(df_indexed)
print("============================================")
print(df)

      Age
Name
Ali    23
Sara   25
============================================
   Name  Age
0   Ali   23
1  Sara   25

In [167]:
df = pd.DataFrame({
    'A': [10, 20],
    'B': [30, 40]
}, index=['row1', 'row2'])

# Rename column A to X, row1 to r1
df = df.rename(columns={'A': 'X','B':4}, index={'row1': 'r1'})

print(df)

       X   4
r1    10  30
row2  20  40

In [168]:
df = pd.DataFrame({
    'A': [10, 20],
    'B': [30, 40]
}, index=['row1', 'row2'])

df

       A   B
row1  10  30
row2  20  40

In [169]:
s1  = pd.Series({
    'A': [10, 20],
    'B': [30, 40]
})

df = pd.DataFrame(s1, index=['row1', 'row2'],columns=['A'])

df

        A
row1  NaN
row2  NaN

In [170]:
data = {
    'A': [10, 20],
    'B': [30, 40]
}

df = pd.DataFrame(data, index=['row1', 'row2'],columns=['X','Y'])
print(df)

        X    Y
row1  NaN  NaN
row2  NaN  NaN

In [171]:
data = {
    'A': [10, 20],
    'B': [30, 40]
}

df = pd.DataFrame(data, index=['row1', 'row2'])
df.columns = ['X', 'Y']  # Rename columns
df.index = [100,200]
print(df)

      X   Y
100  10  30
200  20  40

In [172]:
import pandas as pd

s = pd.Series([10, 20, 30], index=['row1', 'row2', 'row3'], name='Column1')

df = pd.DataFrame(s)
print(df)

      Column1
row1       10
row2       20
row3       30

In [173]:
s1 = pd.Series([10, 20, 30], index=['row1', 'row2', 'row3'])
s2 = pd.Series([40, 50, 60], index=['row1', 'row2', 'row3'])

df = pd.DataFrame({'Column1': s1, 'Column2': s2})
print(df)

      Column1  Column2
row1       10       40
row2       20       50
row3       30       60

In [174]:
data = {
    'Column1': pd.Series([10, 20, 30], index=['row1', 'row2', 'row3']),
    'Column2': pd.Series([40, 50, 60], index=['row1', 'row2', 'row3'])
}

df = pd.DataFrame(data)
print(df)

      Column1  Column2
row1       10       40
row2       20       50
row3       30       60

In [175]:
s1  = pd.Series({
    'A': [10, 20],
    'B': [30, 40]
})

df = pd.DataFrame(s1, index=['row1', 'row2'],columns=['a'])

df

        a
row1  NaN
row2  NaN

In [176]:
s1 = pd.Series({
    'A': [10, 20],
    'B': [30, 40]
})

# Using only one column in the DataFrame, we can directly flatten the structure
df = pd.DataFrame(s1['A'], index=['row1', 'row2'], columns=['a'])
print(df)

       a
row1  10
row2  20